Hi, I get the same behavior for built in roles, using azurerm_builtin_role_definition or azurerm_role_definition.

data azurerm_builtin_role_definition contributor {
  name = "Contributor"
}

OR

data azurerm_role_definition contributor {
  name = "Contributor"
}

Here is the output from plan/apply
  # module.service.azurerm_role_assignment.app-role must be replaced
-/+ resource "azurerm_role_assignment" "app-role" {
      ~ id                               = "/subscriptions/1234/resourceGroups/service-nexus-test1-westus2-dev/providers/Microsoft.Authorization/roleAssignments/6fea8cf5-5113-299f-aa9e-5e4be190fc2f" -> (known after apply)
      ~ name                             = "6fea8cf5-5113-299f-aa9e-5e4be190fc2f" -> (known after apply)
        principal_id                     = "7f16a9bb-a75d-4953-8c50-61b7ae694bb4"
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1234/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" # forces replacement
      ~ role_definition_name             = "Contributor" -> (known after apply)
        scope                            = "/subscriptions/1234/resourceGroups/service-test1-westus2-dev"
      + skip_service_principal_aad_check = (known after apply)
    }